# 概述
静态路由是指由管理员手工配置的路由信息，一般适用于比较简单的网络环境。当网络拓扑发生变化时，管理员需要手工修改相关的静态路由条目。

静态路由在默认情况下是设备本地私有的，不会传递给其他的路由器，且度量值固定为"0"。

# 网段路由
## 简介
网段路由是最常用的静态路由，指向某个网络。

## 配置方法
🔵 Cisco设备

```text
# 添加IPv4静态路由
Cisco(config)# ip rotue <目标网络ID> <子网掩码> {<下一跳地址> | <出站接口>} [Metric] [Permanent]

# 添加IPv6静态路由
Cisco(config)# ipv6 route <目标网络前缀>/<前缀长度> {<下一跳地址> | <出站接口>}
```

Cisco设备默认未启用IPv6路由功能，只能访问邻居设备，无法实现隔跳访问。

## 注意事项
数据包确定出站接口后，若出站网段为点到点型，对端必然只有一个设备，可以直接发送。

若出站网段为多路访问型，可能存在多个节点，路由器需获取下一跳的MAC地址，以便生成链路层帧。如果我们只配置出站接口，路由器会根据数据包目的地址发出ARP请求，出站网段内拥有相关路由信息的节点会作代理ARP响应；若相关节点未开启代理ARP，则会导致转发失败。

综上所述，当出站接口属于点到点型网段时，我们应当指定出站接口；当出站接口属于多路访问型网段时，应当指定下一跳IP地址。

# 主机路由
## 简介
主机路由是指向特定IP地址息的路由信，使网络管理员能够更精确地控制和测试网络，当有特殊需求时我们可以采用这种路由控制选路。

## 配置方法
🔵 Cisco设备

```text
Cisco(config)# ip route <目标主机地址> 255.255.255.255 {<下一跳地址> | <出站接口>}
```

# 负载均衡
我们在某个路由器上添加两条默认路由，分别指向其连接的两个运营商网络，即可实现负载均衡。

<div align="center">

![负载均衡示例](./Assets-静态路由/负载均衡-负载均衡示例.jpg)

</div>

```text
Cisco(config)# ip route 0.0.0.0 0.0.0.0 1.1.1.1
Cisco(config)# ip route 0.0.0.0 0.0.0.0 2.2.2.2
```

此时查看路由器上的路由表：

```text
Cisco# show ip route
S*    0.0.0.0/0	[1/0] via 2.2.2.2
             	[1/0] via 1.1.1.1
      1.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        1.1.1.0/24 is directly connected, Ethernet0/1
      2.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        2.2.2.0/24 is directly connected, Ethernet0/2
```

此时收到匹配默认路由的数据包时，设备将会随机选择1.1.1.1或2.2.2.2为目的地址进行发送。

# 浮动静态路由
如果我们给指向同一目标的路由条目设置不同的度量值，当度量值较小的链路失效时，可以自动切换到度量值较大的链路。

以下图拓扑为例，R3与 `192.168.1.0/24` 网段相连，我们在R1上配置两条指向 `192.168.1.0/24` 的路由条目，此时当直连链路发生故障时，数据转发可以自动切换。

<div align="center">

![浮动静态路由示例](./Assets-静态路由/浮动静态路由-浮动静态路由示例.jpg)

</div>

我们首先在R1上配置两条指向 `192.168.1.0/24` 的静态路由，并将较远的路径度量值设为10。

```text
R1(config)# ip route 192.168.1.0 255.255.255.0 e0/2
R1(config)# ip route 192.168.1.0 255.255.255.0 e0/1 10
```

接着在R2和R3上配置相应的返程路由，然后在R1上追踪前往 `192.168.1.0/24` 的路由。

```text
R1# traceroute 192.168.1.254
Tracing the route to 192.168.1.254
VRF info: (vrf in name/id, vrf out name/id)
  1 10.0.0.6 0 msec 5 msec 6 msec
```

此时R1通过"e0/2"接口发送数据包，度量值为"0"的静态路由生效。

关闭R1与R3的直连接口"e0/2"后（模拟链路失效），在R1上追踪前往 `192.168.1.0/24` 的路由。

```text
R1# traceroute 192.168.1.254
Tracing the route to 192.168.1.254
VRF info: (vrf in name/id, vrf out name/id)
  1 10.0.0.2 5 msec 1 msec 6 msec
  2 10.0.0.10 0 msec 1 msec 0 msec
```

此时R1通过"e0/1"接口发送数据包，度量值为"10"的静态路由生效，实现了自动切换。
