# 简介
三层交换机是具有部分网络层功能的交换机，它工作在OSI参考模型的第三层。三层交换机执行数据包转发等动作时，可使用专用芯片完成，而路由信息更新、路由表维护、路由计算等功能，则需要由软件实现。

三层交换机最重要的功能是加快大型局域网内部的数据交换，其路由能力也是为这一目的服务的，因此路由功能较为单一，不适合连接异构网络。

<div align="center">

![三层交换机的结构](./Assets-三层交换/概述-三层交换机的结构.jpg)

</div>

# 术语
## 交换虚拟接口
交换虚拟接口(Switch Virtual Interface, SVI)是三层交换机用于实现VLAN间路由的逻辑接口，当我们为VLAN创建SVI接口并配置IP地址后，对应的网段就会加入路由表，VLAN中的主机可以使用SVI接口作为网关与外界通信。SVI接口在网络层连通VLAN与外部网络，因此人们也把它称为三层逻辑接口。

SVI接口具有路由器接口的基本特性，比如：拥有独立的MAC地址、能够配置IP地址、支持部分网络层协议（例如：路由协议）。同一台设备上每个VLAN最多可配置一个SVI接口。

通常交换机的默认VLAN(VLAN 1)自带SVI且不能被删除，它的作用是对设备进行远程管理，如果我们不用VLAN 1作为管理VLAN，可以将它的SVI设为关闭。

二层交换机的VLAN也可以拥有SVI接口，但整机只能同时启用一个SVI接口，如果我们开启新VLAN的SVI，上一个活跃的SVI将会自动关闭。这是厂家根据设备功能定位与硬件性能所做出的限制，二层交换机的SVI只能接入管理VLAN便于管理员进行远程控制。

SVI接口状态为“启用”时才能正常工作，需要满足以下条件：

- 对应的VLAN必须存在。
- 对应的VLAN中至少有一个物理端口状态为“启用”，或设备上有至少一个Trunk接口状态为“启用”。
- SVI接口的管理状态为“启用”。

# 工作流程
三层交换机的路由表相当于路由表和ARP表的组合，能够实现高速交换，这种路由表的生成方式主要有两种：

## 按需生成
当有新的流量传入时，交换机首先读取IP数据包头部的目的地址，将第一个数据包进行路由，同时记住目的端口；后续相同的流量就可以直接转发到相应端口，没有必要将每个数据包都进行路由，这就是所谓的“一次路由，多次交换”。当长时间没有数据刷新表项后，该表项将被删除。

## 预先生成
有些交换机只要学习到ARP条目，就会自动生成主机路由，并保持主机路由与ARP条目之间的同步。

按此方式工作的设备相对第一种较少，因为这种方式对硬件资源的消耗较大；它的优点是第一个数据包就能直接进行交换，转发性能略高。

# 基本应用
## 场景描述
我们尝试通过三层交换机的SVI，实现VLAN之间的通信。

本示例的拓扑如下图所示：

<div align="center">

![实验拓扑图](./Assets-三层交换/基本应用-实验拓扑图.jpg)

</div>

三层交换机S1、S2之间通过Trunk链路互联，其中有VLAN 10和VLAN 20，网段与接口IP信息上图所示。

## 配置步骤
我们首先在S1上创建两个VLAN对应的SVI，并设置IP地址等信息。

```text
# 进入VLAN 10对应的SVI设置菜单
# 如果该SVI不存在，则会自动创建。
S1(config)# int vlan 10

# 设置IP地址与子网掩码
S1(config-if)# ip address 192.168.10.253 255.255.255.0

# 将SVI管理状态设为启用
# 部分设备的SVI创建后为禁用状态，需要手动开启。
S1(config-if)# no shutdown

# 返回前级菜单
S1(config-if)# exit


# 配置VLAN 20对应的SVI
S1(config)# int vlan 20
S1(config-if)# ip address 192.168.20.253 255.255.255.0
S1(config-if)# no shutdown
S1(config-if)# exit
```

接着我们在S2上创建两个VLAN对应的SVI，并设置接口信息。

```text
S2(config)# int vlan 10
S2(config-if)# ip address 192.168.10.254 255.255.255.0
S2(config-if)# no shutdown
S2(config-if)# exit


S2(config)# int vlan 20
S2(config-if)# ip address 192.168.20.254 255.255.255.0
S2(config-if)# no shutdown
S2(config-if)# exit
```

配置完成后，我们可以使用 `show ip interface brief` 命令查看SVI接口的IP地址与状态信息：

```text
S1# show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            unassigned      YES unset  up                    up      
Ethernet0/1            unassigned      YES unset  up                    up      
Ethernet0/2            unassigned      YES unset  up                    up      
Ethernet0/3            unassigned      YES unset  up                    up      
Vlan10                 192.168.10.253  YES manual up                    up      
Vlan20                 192.168.20.253  YES manual up                    up
```

## 功能测试
我们在PC1上进行路由追踪，目标地址是PC2。

```text
PC1> trace 192.168.20.1 -P 1
trace to 192.168.20.1, 8 hops max (ICMP), press Ctrl+C to stop
 1   192.168.10.253   0.406 ms  0.409 ms  0.388 ms
 2   192.168.20.1   1.788 ms  0.640 ms  0.633 ms
```

从上述路由追踪信息可知，PC1使用S1上的SVI地址作为网关，能够成功的与VLAN外界相互通信。

此时使用命令查看S1的路由信息：

```text
S1# show ip route
      192.168.10.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.10.0/24 is directly connected, Vlan10
      192.168.20.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.20.0/24 is directly connected, Vlan20
```

从路由表信息可知，两个VLAN的SVI地址所属网段已经被加入路由表，因此能够实现网络层的通信。

# 构建三层链路
因为三层交换机具有网络层通信的能力，其接口不仅可以工作在数据链路层，还可以工作在网络层，与路由器、防火墙等设备互联。

## 典型方式
大多数三层交换机可以将端口切换为路由模式，此时这种端口具有路由器接口的功能，可以直接配置IP地址等属性。

以前文示例为基础，我们将S1与R1相连的接口"e0/3"配置为路由端口，并设置IP地址。

```text
# 进入端口配置菜单
S1(config)# int e0/3

# 以Cisco设备为例，“关闭交换端口”即意味着端口转为路由模式。
S1(config-if)# no switchport

# 路由端口可以设置IP地址等信息
S1(config-if)# ip address 10.0.1.1 255.255.255.252

# 返回前级菜单
S1(config-if)# exit
```

配置完成后，我们在S1上发起连通性测试，目标为R1的直连接口地址。

```text
S1# ping 10.0.1.2
Sending 5, 100-byte ICMP Echos to 10.0.1.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
```

测试通过，说明S1上的路由接口能够正常工作。

## 非典型方式
部分三层交换机不支持直接将物理端口切换为路由模式，此时我们可以创建一个专用的VLAN，把某个物理端口划入其中，然后通过SVI实现网络层功能。

以前文示例为基础，我们创建一个VLAN并配置SVI，将S2与R2相连的接口"e0/3"划入其中作为接入端口。

```text
# 创建VLAN 999
S2(config)# vlan 999

# 返回前级菜单
S2(config-vlan)# exit


# 进入SVI 999配置菜单
S2(config)# int vlan 999

# 为SVI设置IP地址信息
S2(config-if)# ip address 10.0.2.1 255.255.255.252

# 返回前级菜单
S2(config-if)# exit


# 进入物理端口配置菜单
S2(config)# int e0/3

# 将该接口设为接入模式
S2(config-if)# switchport mode access

# 将该接口划入VLAN 999
S2(config-if)# switchport access vlan 999

# 返回前级菜单
S2(config-if)# exit
```

配置完成后，我们在S1上发起连通性测试，目标为R1的直连接口地址。

```text
S2# ping 10.0.2.2 
Sending 5, 100-byte ICMP Echos to 10.0.2.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
```

测试通过，说明S2上使用SVI实现的路由接口也能够正常工作。

# 命令列表
## Cisco设备
### 基本配置
🔷 创建/删除SVI

```text
Cisco(config)# {no} int vlan [VLAN ID]
```

进入SVI配置菜单时，若SVI不存在则会自动创建。

添加"no"选项表示删除SVI。

🔷 开启/关闭SVI

```text
Cisco(config)# int vlan [VLAN ID]
Cisco(config-if)# {no} shutdown
```

### 构建三层链路
🔶 切换端口模式

```text
# 将端口切换为三层模式
Cisco(config-if)# no switchport

# 将端口切换为二层模式
Cisco(config-if)# switchport
```
